backend/app/controllers/comments_controller.rb

    def index
        comments = Comment.all
---
SELECT "comments".* FROM "comments"

    def create
        comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hello"], ["post_id", 1], ["created_at", "2021-05-08 02:17:54.432463"], ["updated_at", "2021-05-08 02:17:54.432463"]]

    def destroy
        comment = Comment.find_by(id: params[:id])
        comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 36], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 36]]