backend/app/controllers/posts_controller.rb

    def index
        posts = Post.all
---
SELECT "posts".* FROM "posts"

    def create
        byebug
        post = Post.new(post_params)
        if post.save
---
INSERT INTO "posts" ("title", "description", "img_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "New Post"], ["description", "hahshdfdfa"], ["img_url", "Random URL"], ["created_at", "2021-05-11 02:39:56.541988"], ["updated_at", "2021-05-11 02:39:56.541988"]]

    def destroy
        post = Post.find_by(id: params[:id])
        post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]